mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
/* Copyright 2017 Duncan Law (mrdunk@gmail.com)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */


#include <ESP8266WebServer.h>
#include "FS.h"

#include "http_server.h"
#include "ipv4_helpers.h"
#include "config.h"
#include "serve_files.h"


extern void setPullFirmware(bool pull);
extern WiFiClient wifiClient;

HttpServer::HttpServer(char* _buffer,
                       const int _buffer_size,
                       Config* _config,
                       MdnsLookup* _brokers,
                       mdns::MDns* _mdns,
                       Mqtt* _mqtt,
                       Io* _io) :
    buffer(_buffer),
    buffer_size(_buffer_size),
    config(_config),
    brokers(_brokers),
    mdns(_mdns),
    mqtt(_mqtt),
    io(_io)
{
  esp8266_http_server = MyESP8266WebServer(HTTP_PORT);
  esp8266_http_server.on("/test", [&]() {onTest();});
  esp8266_http_server.on("/", [&]() {onRoot();});
  esp8266_http_server.on("/set", [&]() {onSet();});
  esp8266_http_server.on("/set/", [&]() {onSet();});
  esp8266_http_server.on("/reset", [&]() {onReset();});
  esp8266_http_server.on("/reset/", [&]() {onReset();});
  esp8266_http_server.on("/filenames.sys", [&]() {fileBrowser(true);});
  esp8266_http_server.on("/get", [&]() {onFileOperations();});
  esp8266_http_server.on("/pull", [&]() {pullFiles();});
  esp8266_http_server.on("/login", [&]() {handleLogin();});
  esp8266_http_server.on("/isauth", [&]() {
      if(isAuthentified()){
        esp8266_http_server.send(200, "text/plain", "auth OK");
      } else {
        esp8266_http_server.send(200, "text/plain", "no auth"); 
      }
  });
  esp8266_http_server.on("/auth", [&]() {
      if(!esp8266_http_server.authenticate("test", "test")){
        return esp8266_http_server.requestAuthentication();
      }
      esp8266_http_server.send(200, "text/plain", "Login OK");
  });
  esp8266_http_server.onNotFound([&]() {handleNotFound();});

  const char * headerkeys[] = {"User-Agent", "Cookie", "Referer"} ;
  size_t headerkeyssize = sizeof(headerkeys)/sizeof(char*);
  //ask server to track these headers
  esp8266_http_server.collectHeaders(headerkeys, headerkeyssize);

  esp8266_http_server.begin();
  bufferClear();
}

void HttpServer::fetchCookie(){
  config->session_token_provided = 0;
  if (esp8266_http_server.hasHeader("Cookie")){
    //config->session_token_provided = esp8266_http_server.header("Cookie");
    if(esp8266_http_server.header("Cookie").startsWith("ESPSESSIONID=")){
      String cookie =
        esp8266_http_server.header("Cookie").substring(strlen("ESPSESSIONID="));
      config->session_token_provided = strtoul(cookie.c_str(), NULL, 10);
    }
  }
}

void HttpServer::pullFiles(){
  bufferClear();
  fetchCookie();

  bool header_received = false;
  int status_code = 0;
  String content_type = "";

  char firmwarehost[64];
  strncpy(firmwarehost, config->firmwarehost, 64);
  uint16_t firmwareport = config->firmwareport;
  String firmwaredirectory = config->firmwaredirectory;

  if(esp8266_http_server.hasArg("firmwarehost")){
    esp8266_http_server.arg("firmwarehost").toCharArray(firmwarehost, 64);
  }
  if(esp8266_http_server.hasArg("firmwareport")){
    firmwareport = esp8266_http_server.arg("firmwareport").toInt();
  }
  if(esp8266_http_server.hasArg("firmwaredirectory")){
    firmwaredirectory = esp8266_http_server.arg("firmwaredirectory");
  }

  if(firmwareport == 0){
    firmwareport = 80;
  }
  if(firmwaredirectory == ""){
    firmwaredirectory = "/";
  }

  // Send headers to start http connection.
  esp8266_http_server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  if(esp8266_http_server.hasArg("action") and
      esp8266_http_server.arg("action") == "compiled_source"){
    esp8266_http_server.send(200, "text/plain", "");
  } else {
    esp8266_http_server.send(200, "text/html", "");
  }


  // Fetch Web page from external file server so we can re-write it with our
  // pull requests.
  if(wifiClient.connect(firmwarehost, firmwareport)){
    // Make an HTTP GET request
    wifiClient.println(String("GET ") + firmwaredirectory + " HTTP/1.1");
    wifiClient.print("Host: ");
    wifiClient.println(firmwarehost);
    wifiClient.println("Connection: close");
    wifiClient.println();
  } else {
    return;
  }

  // If there are incoming bytes, print them
	while (wifiClient.connected()){
		if(wifiClient.available()){
			String line = wifiClient.readStringUntil('\n');
      
      if(!header_received){
        line.trim();
        if(line.startsWith("HTTP/") and line.endsWith("OK")){
          line = line.substring(line.indexOf(" "));
          line.trim();
          status_code = line.substring(0, line.indexOf(" ")).toInt();
        }
        if(line.startsWith("Content-type:")){
          content_type = line.substring(line.indexOf(" "));
          content_type.trim();
        }
        if(line == ""){
          if(status_code == HTTP_OK and content_type != ""){
            header_received = true;
            Serial.print("Status code: ");
            Serial.println(status_code);
            Serial.print("Content type: ");
            Serial.println(content_type);
            Serial.println();
          } else {
            Serial.println("Malformed header.");
            return;
          }
        }
      } else {
        // Any line that contains a link should be modified.
        int filename_start = line.indexOf("<a href=\"");
        int filename_end;
        String filename = "";
        if(filename_start >= 0){
          filename_start += strlen("<a href=\"");
          filename_end = line.substring(filename_start).indexOf("\"");

          filename = line.substring(filename_start, filename_start + filename_end);
          if(sanitizeFilename(filename)){
            String modified_line = line.substring(0, filename_start);
            modified_line += "./get?filename=" + filename + "&action=pull";
            modified_line += line.substring(filename_start + filename_end);
            esp8266_http_server.sendContent(modified_line + "\n");
          }
        } else {
          // Line does not contain link so don't modify it.
          esp8266_http_server.sendContent(line + "\n");
        }
      }
    }
  }

