mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
  esp8266_http_server.sendHeader("Connection", "close");
  wifiClient.stop();
}

//Check if header is present and correct
bool HttpServer::isAuthentified(bool redirect){
  Serial.println("isAuthentified()");
  fetchCookie();

  if (config->session_token == config->session_token_provided){
    Serial.println("Authentication Successful");
    return true;
  }
  Serial.println("Authentication Failed");
  if(redirect){
    esp8266_http_server.sendHeader("Location","/login");
    esp8266_http_server.sendHeader("Cache-Control","no-cache");
    esp8266_http_server.sendHeader("Set-Cookie","ESPSESSIONID=0");
    esp8266_http_server.send(307);
  }
  return false;
}

//login page, also called for disconnect
void HttpServer::handleLogin(){
  Serial.println("handleLogin()");
  String msg;
  String action("/login");

  if(esp8266_http_server.header("Referer")){
    action = esp8266_http_server.header("Referer");
  }

  if (esp8266_http_server.hasHeader("Cookie")){
    Serial.print("Found cookie: ");
    String cookie = esp8266_http_server.header("Cookie");
    Serial.println(cookie);
  }
  if (esp8266_http_server.hasArg("DISCONNECT")){
    Serial.println("Disconnection");
    esp8266_http_server.sendHeader("Location", action);
    esp8266_http_server.sendHeader("Cache-Control","no-cache");
    esp8266_http_server.sendHeader("Set-Cookie","ESPSESSIONID=0");
    config->session_token_provided = 0;
    esp8266_http_server.send(301);
    return;
  }
  if (esp8266_http_server.hasArg("DISCONNECT_ALL")){
    // Disconnect every bodies sessions.
    Serial.println("Disconnection");
    esp8266_http_server.sendHeader("Location", action);
    esp8266_http_server.sendHeader("Cache-Control","no-cache");
    esp8266_http_server.sendHeader("Set-Cookie","ESPSESSIONID=0");
    config->session_token_provided = 0;
    config->session_token = 0;
    config->session_override = false;
    esp8266_http_server.send(301);
    return;
  }
  if (esp8266_http_server.hasArg("USERNAME") && esp8266_http_server.hasArg("PASSWORD")){
    if (esp8266_http_server.arg("USERNAME") == "admin" && 
        esp8266_http_server.arg("PASSWORD") == "admin" )
    {
      if(config->sessionExpired() || config->session_token <= 0){
        config->session_token = (uint32_t)secureRandom(UINT32_MAX);
      }
      config->session_time = millis() / 1000;

      esp8266_http_server.sendHeader("Location", action);
      esp8266_http_server.sendHeader("Cache-Control","no-cache");
      String cookie_header("ESPSESSIONID=");
      cookie_header += config->session_token;
      config->session_token_provided = config->session_token;
      esp8266_http_server.sendHeader("Set-Cookie", cookie_header);
      esp8266_http_server.send(301);
      Serial.println("Log in Successful");
      return;
    }
    msg = "Wrong username/password! try again.";
    Serial.println("Log in Failed");
  }
  String content = "<html><body><form action='/login' method='POST'>";
  content += "User:<input type='text' name='USERNAME' placeholder='user name'><br>";
  content += "Password:<input type='password' name='PASSWORD' placeholder='password'><br>";
  content += "<input type='submit' name='SUBMIT' value='Submit'></form>" + msg + "<br>";
  content += "</body></html>";
  esp8266_http_server.send(200, "text/html", content);
}

void HttpServer::loop(){
  esp8266_http_server.handleClient();
}

void  HttpServer::onRoot(){
  onFileOperations("loader.html");
}

void HttpServer::onTest(){
  bufferAppend(" testing ");
  esp8266_http_server.send(200, "text/plain", buffer);
}

void HttpServer::handleNotFound(){
  String filename = esp8266_http_server.uri();
  filename.remove(0, 1); // Leading "/" character.
  onFileOperations(filename);
}

void HttpServer::onFileOperations(const String& _filename){
  bufferClear();
  fetchCookie();

  String filename = "";
  if(_filename.length()){
    filename = _filename;
  } else if(esp8266_http_server.hasArg("filename")){
    filename = esp8266_http_server.arg("filename");
  }

  if(filename.length() && sanitizeFilename(filename)){
    if(esp8266_http_server.hasArg("action") and 
          esp8266_http_server.arg("action") == "pull")
    {
      // Pull file from server.
      Serial.print("Pull file from server: ");
      Serial.println(filename);

      bufferAppend("Pulling firmware from " +
          String(config->firmwarehost) + ":" + String(config->firmwareport) +
          String(config->firmwaredirectory) + filename + "\n");
      if(filename == "firmware.bin"){
        esp8266_http_server.send(200, "text/plain", buffer);
        // Set flag in persistent filesystem and reboot so we pull new firmware on
        // next boot.
        setPullFirmware(true);

        delay(100);
        ESP.reset();
      } else {
        if(!pullFile(filename, *config)){
          bufferAppend("\nUnsuccessful.\n");
          esp8266_http_server.send(404, "text/plain", buffer);
          return;
        }
        bufferAppend("Successfully got file from server.\n");
        esp8266_http_server.send(200, "text/plain", buffer);
        return;
      }
    } else if(esp8266_http_server.hasArg("action") and
        esp8266_http_server.arg("action") == "del")
    {
      Serial.print("Deleting: ");
      Serial.println(filename);

      if(!SPIFFS.begin()){
        Serial.println("WARNING: Unable to SPIFFS.begin()");
        return;
      }
      if(!SPIFFS.exists(String("/") + filename)){
        bufferAppend("\nUnsuccessful.\n");
        esp8266_http_server.send(404, "text/plain", buffer);
        SPIFFS.end();
        return;
      }

      if(!SPIFFS.remove(String("/") + filename)){
        SPIFFS.end();
        bufferAppend("\nUnsuccessful.\n");
        esp8266_http_server.send(404, "text/plain", buffer);
        return;
      }
      SPIFFS.end();
      buffer[0] = '\0';
      bufferAppend("Successfully deleted ");
      bufferAppend(filename);
      esp8266_http_server.send(200, "text/plain", buffer);
    } else {
      Serial.print("Displaying file: ");
      Serial.print(filename);
      
