mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
        int tmp_buffer_in_len = list_template[list_depth].buffer_len;
        char* tmp_buffer_in = (char*)malloc(tmp_buffer_in_len);
        memcpy(tmp_buffer_in, list_template[list_depth].buffer, tmp_buffer_in_len);
        bool parsing_list_inner = false;
        parseBuffer(tmp_buffer_in, tmp_buffer_in_len,
                    buffer_out, buffer_out_len, list_depth, parsing_list_inner);
        free(tmp_buffer_in);
      }

      buffer_tail = close_tag + strlen(list_template[list_depth].tag) + strlen("{{/}}");
      
      free(list_template[list_depth].buffer);
      list_template[list_depth].buffer = NULL;
      list_template[list_depth].buffer_len = 0;
      exitList(list_parent);
      list_depth--;
      parsing_list = false;
        
    } else if(tag_start && tagName(tag_start, tag, type)){
      // {{tag}} found.

      int len_to_tag = tag_start - buffer_tail;
      int len_buff_space = buffer_out_len - strlen(buffer_out) -1;
      if(len_to_tag > len_buff_space){
        // Only enough space in output buffer for content before {{tag}}.
        buffer_out_len += len_to_tag + TAG_NAME_LEN;
        buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
        if(!buffer_out){
          Serial.println("ERROR: Failed realloc()");
          break;
        }
      }

      strncat(buffer_out, buffer_tail, len_to_tag);
      len_buff_space -= len_to_tag;

      char tag_content[128];
      int element_count = 0;

      if(type == tagPlain){
        replaceTag(tag_content, element_count, tag, type, 128, list_depth);
        if((int)strlen(tag_content) > len_buff_space){
          len_buff_space = strlen(tag_content);
          buffer_out_len += strlen(tag_content);
          buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
          if(!buffer_out){
            Serial.println("ERROR: Failed realloc()");
            break;
          }
        }
        strncat(buffer_out, tag_content, len_buff_space);
        buffer_tail += len_to_tag + strnlen(tag, 128) + strlen("{{}}");
      } else if(type == tagList || type == tagInverted){

        parsing_list = true;
        list_depth++;
        enterList(list_parent, tag);

        strncpy(list_template[list_depth].tag, tag, TAG_NAME_LEN);
        list_template[list_depth].inverted = (type == tagInverted);
        list_template[list_depth].buffer = (char*)malloc(1);
        list_template[list_depth].buffer_len = 1;
        list_template[list_depth].buffer[0] = '\0';
        buffer_tail = tag_start + strlen(tag) + strlen("{{#}}");
      }
    } else if(tag_start &&
        tag_start >= (buffer_in + buffer_in_len - TAG_NAME_LEN - strlen("{{#}}")))
    {
      // File content with no {{tag}} followed by a {{tag}} near the end.
      // Since the {{tag}} is possibly not completely in the buffer_in, only
      // process everything up to {{tag}}.
      if(tag_start - buffer_tail <= 0){
        // All data worth sending has been added to buffer_out.
        break;
      }
      if(tag_start - buffer_tail > 
          buffer_out_len - (int)strlen(buffer_out) -1)
      {
        buffer_out_len += tag_start - buffer_tail;
        buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
      }
      strncat(buffer_out, buffer_tail, tag_start - buffer_tail);
      buffer_tail += tag_start - buffer_tail;
    } else {
      // No {{tag}} in buffer_in. Copy everything to buffer_out.
      if(strlen(buffer_tail) > buffer_out_len - strlen(buffer_out) -1){
        buffer_out_len += strlen(buffer_tail);
        buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
      }
      strncat(buffer_out, buffer_tail, strlen(buffer_tail));
      buffer_tail += strlen(buffer_tail);
    }
  }

  memmove(buffer_in, buffer_tail, strlen(buffer_tail) +1);
}

char* CompileMustache::findClosingTag(char* buffer_in, const int buffer_in_len,
                                      const char* tag)
{
  char full_tag[TAG_NAME_LEN + strlen("{{/}}") +1];
  full_tag[0] = '\0';
  strcat(full_tag, "{{/");
  strcat(full_tag, tag);
  strcat(full_tag, "}}");
  return findPattern(buffer_in, full_tag, buffer_in_len);
}


bool CompileMustache::tagName(char* tag_start, char* tag, tagType& type){
  type = tagUnset;
  if(!tag_start || tag_start[0] != '{' || tag_start[1] != '{'){
    return false;
  }
  tag_start += 2;

  for(int i = 0; i < TAG_NAME_LEN; i++){
    // Skip through any "{{" deliminators and whitespace to start of tag name.
    if(*tag_start >= '!' and *tag_start <= 'z' and
        *tag_start != '#' and *tag_start != '^'){
      break;
    }
    switch(*tag_start)
    {
      case '#':
        if(type != tagUnset) {return false;}
        type = tagList;
        break;
      case '^':
        if(type != tagUnset) {return false;}
        type = tagInverted;
        break;
    }

    tag_start ++;
  }
  if(type == tagUnset){
    type = tagPlain;
  }

  if(findPattern(tag_start, "}}", TAG_NAME_LEN)){
    strncpy(tag, tag_start, TAG_NAME_LEN);
    char* end_pattern = findPattern(tag, "}}", TAG_NAME_LEN);
    if(end_pattern){
      *end_pattern = '\0';
      while(strlen(tag)){
        if(tag[strlen(tag)] == ' '){
          // Remove trailing whitespace.
          tag[strlen(tag)] = '\0';
        } else {
          break;
        }
      }
      return true;
    }
    // empty string.
    tag[0] = '\0';
  }
  return false;
}

void CompileMustache::replaceTag(char* destination,
                                  int& element_count,
                                  const char* tag,
                                  const tagType type,
                                  const int len,
                                  const int list_depth)
{
  memset(destination, '\0', len);
  element_count = 0;

  if(strcmp(tag, "session.browser_auth_token") == 0){
    //session_token.toCharArray(destination, len);
    element_count = 1;
  } else if(strcmp(tag, "session.current_auth_token") == 0){
    String current_session_token("ESPSESSIONID=");
    current_session_token += config->session_token;
    current_session_token.toCharArray(destination, len);
    element_count = 1;
  } else if(strcmp(tag, "session.override_auth") == 0){
    String(config->session_override).toCharArray(destination, len);
    element_count = (int)config->session_override;
  } else if(strcmp(tag, "session.valid_until") == 0){
    String(config->session_time + SESSION_TIMEOUT).toCharArray(destination, len);
    element_count = 1;
  } else if(strcmp(tag, "session.valid") == 0){
    const unsigned int now = millis() / 1000;
    const int remaining = config->session_time + SESSION_TIMEOUT - now;
    /*if(config->sessionValid(session_token) && remaining > 0){
      String(config->session_time + SESSION_TIMEOUT - now).toCharArray(destination, len);
      element_count = 1;
    } else {
      String("expired").toCharArray(destination, len);
      element_count = 0;
    }*/
  } else if(strcmp(tag, "session.login_form") == 0){

