mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
  } else if(strcmp(tag, "host.mac") == 0){
    uint8_t mac[6];
    WiFi.macAddress(mac);
    String mac_str = macToStr(mac);
    mac_str.toCharArray(destination, len);
    element_count = 1;
  } else if(strcmp(tag, "config.hostname") == 0){
    strncpy(destination, config->hostname, min(HOSTNAME_LEN, len));
    element_count = (bool)strlen(destination);
  } else if(strcmp(tag, "host.ip") == 0){
    ip_to_string(WiFi.localIP()).toCharArray(destination, len);
    element_count = (bool)WiFi.localIP();
  } else if(strcmp(tag, "config.ip") == 0){
    ip_to_string(config->ip).toCharArray(destination, len);
    element_count = (bool)config->ip;
  } else if(strcmp(tag, "config.subnet") == 0){
    ip_to_string(config->subnet).toCharArray(destination, len);
    element_count = (bool)config->subnet;
  } else if(strcmp(tag, "config.gateway") == 0){
    ip_to_string(config->gateway).toCharArray(destination, len);
    element_count = (bool)config->gateway;
  } else if(strcmp(tag, "config.brokerip") == 0){
    ip_to_string(config->brokerip).toCharArray(destination, len);
    element_count = (bool)config->brokerip;
  } else if(strcmp(tag, "config.brokerport") == 0){
    String(config->brokerport).toCharArray(destination, len);
    element_count = config->brokerport > 0;
  } else if(strcmp(tag, "config.subscribeprefix") == 0){
    String(config->subscribeprefix).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "config.publishprefix") == 0){
    String(config->publishprefix).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "config.firmwarehost") == 0){
    String(config->firmwarehost).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "config.firmwaredirectory") == 0){
    String(config->firmwaredirectory).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "config.firmwareport") == 0){
    String(config->firmwareport).toCharArray(destination, len);
    element_count = config->firmwareport > 0;
  } else if(strcmp(tag, "config.enablepassphrase") == 0){
    String(config->enablepassphrase).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "host.rssi") == 0){
    String(WiFi.RSSI()).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "host.cpu_freqency") == 0){
    String(ESP.getCpuFreqMHz()).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "host.flash_size") == 0){
    String(ESP.getFlashChipSize()).toCharArray(destination, len);
    element_count = ESP.getFlashChipSize() > 0;
  } else if(strcmp(tag, "host.flash_space") == 0){
    String(ESP.getFreeSketchSpace()).toCharArray(destination, len);
    element_count = ESP.getFreeSketchSpace() > 0;
  } else if(strcmp(tag, "host.flash_ratio") == 0){
    element_count = 0;
    if(ESP.getFlashChipSize() > 0){
      String(int(100 * ESP.getFreeSketchSpace() / ESP.getFlashChipSize()))
        .toCharArray(destination, len);
      element_count = (100 * ESP.getFreeSketchSpace() / ESP.getFlashChipSize()) >= 1;
    }
  } else if(strcmp(tag, "host.flash_speed") == 0){
    String(ESP.getFlashChipSpeed()).toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "host.free_memory") == 0){
    String(ESP.getFreeHeap()).toCharArray(destination, len);
    element_count = ESP.getFreeHeap() >= 1;
  } else if(strcmp(tag, "host.sdk_version") == 0){
    strncpy(destination, ESP.getSdkVersion(), len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "host.core_version") == 0){
    ESP.getCoreVersion().toCharArray(destination, len);
    element_count = (bool)strnlen(destination, len);
  } else if(strcmp(tag, "io.analogue_in") == 0){
    int val = analogRead(A0);
    String(val).toCharArray(destination, len);
    element_count = val > 0;
  } else if(strcmp(tag, "host.uptime") == 0){
    String(millis() / 1000).toCharArray(destination, len);
    element_count = (millis() / 1000) >= 10;
  } else if(strcmp(tag, "host.buffer_size") == 0){
    String(buffer_size).toCharArray(destination, len);
    element_count = buffer_size > 0;
  } else if(strcmp(tag, "mdns.packet_count") == 0){
    String(mdns->packet_count).toCharArray(destination, len);
    element_count = mdns->packet_count > 0;
  } else if(strcmp(tag, "mdns.buffer_fail") == 0){
    String(mdns->buffer_size_fail).toCharArray(destination, len);
    element_count = 0;
  } else if(strcmp(tag, "mdns.buffer_sucess") == 0){
    String(mdns->packet_count - mdns->buffer_size_fail).toCharArray(destination, len);
    element_count = (mdns->packet_count - mdns->buffer_size_fail) > 0;
  } else if(strcmp(tag, "mdns.largest_packet_seen") == 0){
    String(mdns->largest_packet_seen).toCharArray(destination, len);
    element_count = mdns->largest_packet_seen > 0;
  } else if(strcmp(tag, "mdns.success_rate") == 0){
    element_count = 0;
    if(mdns->packet_count > 0){
      String(100 - (100 * mdns->buffer_size_fail / mdns->packet_count))
        .toCharArray(destination, len);
      element_count = (100 * mdns->buffer_size_fail / mdns->packet_count) >= 1;
    }
  } else if(strcmp(tag, "fs.files") == 0){
    unsigned int now = millis() / 10000;  // 10 Second intervals.
    if(list_size[list_depth] < 0 || now != list_cache_time[list_depth]){
      list_cache_time[list_depth] = now;
      list_size[list_depth] = 0;
    
      Dir dir = SPIFFS.openDir("/");
      while(dir.next()){
        list_size[list_depth]++;
      }
    }
    if(type == tagListItem){
      list_element[list_depth]++;
    } else {
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    }
  } else if(strcmp(tag, "fs.space.used") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    String(fs_info.usedBytes).toCharArray(destination, len);
    element_count = fs_info.usedBytes > 0;
  } else if(strcmp(tag, "fs.space.size") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    String(fs_info.totalBytes).toCharArray(destination, len);
    element_count = fs_info.totalBytes > 0;
  } else if(strcmp(tag, "fs.space.remaining") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    String(fs_info.totalBytes - fs_info.usedBytes).toCharArray(destination, len);
    element_count = (fs_info.totalBytes - fs_info.usedBytes) > 0;
  } else if(strcmp(tag, "fs.space.ratio.used") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    if(fs_info.totalBytes > 0){
      String(100.0 * fs_info.usedBytes / fs_info.totalBytes).toCharArray(destination, len);
      element_count = (100.0 * fs_info.usedBytes / fs_info.totalBytes) >= 1;
    }
  } else if(strcmp(tag, "fs.space.ratio.remaining") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    if(fs_info.totalBytes > 0){
      String(100.0 * (fs_info.totalBytes - fs_info.usedBytes) / fs_info.totalBytes)
        .toCharArray(destination, len);
      element_count =
        (100.0 * (fs_info.totalBytes - fs_info.usedBytes) / fs_info.totalBytes) >= 1;
    }
  } else if(strcmp(tag, "fs.max_filename_len") == 0){
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    String(fs_info.maxPathLength -2).toCharArray(destination, len);
  } else if(strcmp(tag, "servers.mqtt") == 0){
    Host* p_host;
    bool active;
    if(type == tagListItem){
      brokers->IterateHosts(&p_host, &active);
      list_element[list_depth]++;
    } else {
      list_size[list_depth] = 0;
      brokers->ResetIterater();
      while(brokers->IterateHosts(&p_host, &active)){
        list_size[list_depth]++;
      }
      brokers->ResetIterater();
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    }
  } else if(strcmp(tag, "host.ssids") == 0){
    unsigned int now = millis() / 10000;  // 10 Second intervals.
    if(list_size[list_depth] < 0 || now != list_cache_time[list_depth]){
      list_cache_time[list_depth] = now;
      list_size[list_depth] = WiFi.scanNetworks();
    }

    if(type == tagListItem){
      list_element[list_depth]++;
    } else {
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    }
  } else if(strcmp(tag, "io.entry") == 0){
    list_size[list_depth] = 0;
    for (int i = 0; i < MAX_DEVICES; ++i) {
      if (strlen(config->devices[i].address_segment[0].segment) > 0) {
        list_size[list_depth]++;
      }
    }
    if(list_size[list_depth] < MAX_DEVICES){
      list_size[list_depth]++;
    }
    Serial.print("io.entry ");
    Serial.print(list_size[list_depth]);
    Serial.print(" ");
    Serial.println(MAX_DEVICES);

    if(type == tagListItem){
      list_element[list_depth]++;
      element_count = list_size[list_depth];
      Serial.print(" tagListItem ");
      Serial.println(list_element[list_depth]);
    } else {
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
      Serial.println(" else");
    }
  } else if(strcmp(tag, "iopin") == 0){
    list_size[list_depth] = 11;  // 11 IO pins available on the esp8266.
    if(type == tagListItem){
      list_element[list_depth]++;
      element_count = list_size[list_depth];
    } else if(type == tagEnd || type == tagList){
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    } else {
      int context_depth = depthOfParent(list_parent, "|io.entry");
      int selected_value = config->devices[list_element[context_depth]].iopin;
      String(selected_value).toCharArray(destination, len);
      element_count = 1;
    }
  } else if(strcmp(tag, "iotype") == 0){
    list_size[list_depth] = 6;
    if(type == tagListItem){
      list_element[list_depth]++;
      element_count = list_size[list_depth];
    } else if(type == tagEnd || type == tagList){
      list_element[list_depth] = -1;
      String(list_size[list_depth]).toCharArray(destination, len);
      element_count = list_size[list_depth];
    } else {
      char values[][12] = {"test", "onoff", "pwm", "inputpullup", "input", "timer"};
      int context_depth = depthOfParent(list_parent, "|io.entry");
      Io_Type selected_value = config->devices[list_element[context_depth]].io_type;
      String(values[selected_value]).toCharArray(destination, len);
      element_count = 1;
    }
  } else if(strcmp(tag, "ws_health") == 0){
    String div = "<span class=\"ws_health\">ws_health</span>";
    div.toCharArray(destination, len);
    element_count = 1;
  } else if(strcmp(tag, "ws_state") == 0){
    String div = "<span class=\"ws_state\">ws_state</span>";
    div.toCharArray(destination, len);
    element_count = 1;
  }

