mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
  // The following tags work inside lists.
  if(strstr(list_parent, "|io.entry")){
    int parent_depth = depthOfParent(list_parent, "|io.entry");

    // Not every config->devices entry is populated.
    int index = config->labelToIndex(list_element[parent_depth]);

    if(strcmp(tag, "index") == 0){
      String(index).toCharArray(destination, len);
      element_count = index > 0;
    } else if(strcmp(tag, "topic") == 0){
      DeviceAddress(config->devices[index]).toCharArray(destination, len);
      element_count = strlen(destination) > 0;
    } else if(strcmp(tag, "default") == 0){
      String(config->devices[index].io_default).toCharArray(destination, len);
      element_count = strlen(destination) > 0;
    } else if(strcmp(tag, "inverted") == 0){
      String(config->devices[index].inverted ? "Y":"N").toCharArray(destination, len);
      element_count = config->devices[index].inverted;
    } else if(strcmp(tag, "is_populated") == 0){
      bool is_populated = (bool)DeviceAddress(config->devices[index]).length();
      String(is_populated ? "Y":"N").toCharArray(destination, len);
      element_count = (int)is_populated;
    } else if(strcmp(tag, "is_input") == 0){
      bool is_input = (config->devices[index].io_type == Io_Type::inputpullup ||
                      config->devices[index].io_type == Io_Type::input);
      String(is_input ? "Y":"N").toCharArray(destination, len);
      element_count = (int)is_input;
    } else if(strcmp(tag, "is_output") == 0){
      bool is_output = (config->devices[index].io_type == Io_Type::onoff ||
                      config->devices[index].io_type == Io_Type::pwm);
      String(is_output ? "Y":"N").toCharArray(destination, len);
      element_count = (int)is_output;
    } else if(strcmp(tag, "value") == 0){
      int output = 0;
      if(config->devices[index].io_type == Io_Type::inputpullup ||
          config->devices[index].io_type == Io_Type::input ||
          config->devices[index].io_type == Io_Type::onoff)
      {
        output = (bool)config->devices[index].io_value ^ config->devices[index].inverted;
      } else if(config->devices[index].io_type == Io_Type::pwm)
      {
        output = config->devices[index].io_value;
      }
      String(output).toCharArray(destination, len);
      element_count = (int)output;
    } else if(strcmp(tag, "ws_value") == 0){
      String div = "<div class=\"ws_iopin_";
      div += String(config->devices[index].iopin);
      div += "_value\">iopin_";
      div += String(config->devices[index].iopin);
      div += "_value</div>";
      div.toCharArray(destination, len);
      element_count = 1;
    } else if(strcmp(tag, "ws_set_high") == 0){
      String div = "<div class=\"ws_iopin_";
      div += String(config->devices[index].iopin);
      div += "_set_high\">click me</div>";
      div.toCharArray(destination, len);
      element_count = 1;
    } else if(strcmp(tag, "ws_set_low") == 0){
      String div = "<div class=\"ws_iopin_";
      div += String(config->devices[index].iopin);
      div += "_set_low\">click me</div>";
      div.toCharArray(destination, len);
      element_count = 1;
    } else if(strcmp(tag, "ws_set_toggle") == 0){
      String class_id = "ws_iopin_";
      class_id += String(config->devices[index].iopin);
      class_id += "_set_toggle";
      class_id.toCharArray(destination, len);
      element_count = 1;
    }
  }

  if(strstr(list_parent, "|iotype")){
    int parent_depth = depthOfParent(list_parent, "|iotype");
    char values[][12] = {"test", "onoff", "pwm", "inputpullup", "input", "timer"};
    
    if(strcmp(tag, "value") == 0){
      element_count = list_element[list_depth] > 0;
      String(values[list_element[list_depth]]).toCharArray(destination, len);
    } else if(strcmp(tag, "selected") == 0){
      int context_depth = depthOfParent(list_parent, "|io.entry");
      Io_Type selected_value = config->devices[list_element[context_depth]].io_type;

      String(values[selected_value]).toCharArray(destination, len);
      // XXX Is it ok to compare int with Io_Type ?
      element_count = (list_element[parent_depth] == selected_value);
    }
  }

  if(strstr(list_parent, "|iopin")){
    int parent_depth = depthOfParent(list_parent, "|iopin");
    int values[] = {0,1,2,3,4,5,12,13,14,15,16};  // Valid output pins.
    
    if(strcmp(tag, "value") == 0){
      element_count = list_element[list_depth] > 0;
      String(values[list_element[list_depth]]).toCharArray(destination, len);
    } else if(strcmp(tag, "selected") == 0){
      // iopin can be used from more than one context.
      // We need to determine which context and calculate the selected value
      // based on that.
      // TODO: It would be preferable to pass in a value somehow.

      int selected_value = 0;
      if(strstr(list_parent, "|io.entry")){
        // Within the {{#io.entry} context.
        int context_depth = depthOfParent(list_parent, "|io.entry");
        selected_value = config->devices[list_element[context_depth]].iopin;
      } else {
        // Otherwise it's probably the enableiopin context.
        selected_value = config->enableiopin;
      }

      String(selected_value).toCharArray(destination, len);
      element_count = (values[list_element[parent_depth]] == selected_value);
    }
  }

  if(strstr(list_parent, "|host.ssids")){
    if(strcmp(tag, "name") == 0){
      WiFi.SSID(list_element[list_depth]).toCharArray(destination, len);
    } else if(strcmp(tag, "signal") == 0){
      String(WiFi.RSSI(list_element[list_depth])).toCharArray(destination, len);
    }
  }

  if(strstr(list_parent, "|fs.files")){
    int parent_depth = depthOfParent(list_parent, "|fs.files");

    Dir dir = SPIFFS.openDir("/");
    for(int i=0; i <= list_element[parent_depth] && dir.next(); i++){ }

    if(strcmp(tag, "filename") == 0){
      if(type == tagPlain){
        File file = dir.openFile("r");
        String filename = file.name();
        filename.remove(0, 1);
        filename.toCharArray(destination, len);
        file.close();
      }
    } else if(strcmp(tag, "size") == 0){
      if(type == tagPlain){
        File file = dir.openFile("r");
        String(file.size()).toCharArray(destination, len);
        file.close();
      }
    } else if(strcmp(tag, "is_mustache") == 0){
      File file = dir.openFile("r");
      String filename = file.name();
      file.close();
      bool test = filename.endsWith(".mustache");

      if(type == tagListItem){
        element_count = list_element[parent_depth];
      } else {
        element_count = (int)test;
        String(test ? "Y":"N").toCharArray(destination, len);
      }
    }
  }

