mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
  if(strstr(list_parent, "|servers.mqtt")){
    Host* p_host;
    bool active;
    brokers->GetLastHost(&p_host, active);
    if(strcmp(tag, "service_name") == 0){
      if(type == tagPlain){
        p_host->service_name.toCharArray(destination, len);
      }
    } else if(strcmp(tag, "host_name") == 0){
      if(type == tagPlain){
        p_host->host_name.toCharArray(destination, len);
      }
    } else if(strcmp(tag, "address") == 0){
      if(type == tagPlain){
        ip_to_string(p_host->address).toCharArray(destination, len);
      }
    } else if(strcmp(tag, "port") == 0){
      if(type == tagPlain){
        String(p_host->port).toCharArray(destination, len);
      }
    } else if(strcmp(tag, "service_valid_until") == 0){
      if(type == tagPlain){
        String(p_host->service_valid_until).toCharArray(destination, len);
      }
    } else if(strcmp(tag, "host_valid_until") == 0){
      if(type == tagPlain){
        String(p_host->host_valid_until).toCharArray(destination, len);
      }
    } else if(strcmp(tag, "ipv4_valid_until") == 0){
      if(type == tagPlain){
        String(p_host->ipv4_valid_until).toCharArray(destination, len);
      }
    } else if(strcmp(tag, "success_counter") == 0){
      if(type == tagPlain){
        String(p_host->success_counter).toCharArray(destination, len);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "fail_counter") == 0){
      if(type == tagPlain){
        String(p_host->fail_counter).toCharArray(destination, len);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "connection_attempts") == 0){
      if(type == tagPlain){
        String(p_host->success_counter + p_host->fail_counter).toCharArray(destination, len);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "active") == 0){
      if(type == tagPlain){
        if(active){
          strncpy(destination, "active", len);
        }
      } else if(type == tagListItem){
        int parent_depth = depthOfParent(list_parent, "|fs.files");
        element_count = list_element[parent_depth];
      } else {
        element_count = (int)active;
        String(active ? "Y":"N").toCharArray(destination, len);
      }
    }
  }

  /*Serial.print("td |");
  Serial.println(destination);*/
}

void CompileMustache::enterList(char* parents, char* tag){
  strcat(parents, "|");
  strcat(parents, tag);
}

void CompileMustache::exitList(char* parents){
  char* tmp = strrchr(parents, '|');
  if(tmp){
    *tmp = '\0';
  }
}


char* CompileMustache::findPattern(char* buff, const char* pattern, int line_len)
  const{
  for(int i = 0; i < line_len; i++){
    if(strncmp (buff + i, pattern, strlen(pattern)) == 0){
      return buff +i;
    }
  }
  return NULL;
}


bool sanitizeFilename(const String& buffer){
  bool valid = true;
  for(unsigned int i=0; i < buffer.length();i++){
    if(buffer[i] >= 'A' && buffer[i] <= 'Z'){
      // pass
    } else if(buffer[i] >= 'a' && buffer[i] <= 'z'){
      // pass
    } else if(buffer[i] >= '0' && buffer[i] <= '9'){
      // pass
    } else if(buffer[i] == '.' && i > 0){
      // Don't allow '.' as the first character in a file.
      // pass
    } else if(buffer[i] == '_'){
      // pass
    } else if(buffer[i] == '-'){
      // pass
    } else {
      Serial.print("Invalid char in filename: ");
      Serial.print(buffer);
      Serial.print("  at pos ");
      Serial.println(i);
      valid = false;
    }
  }
  return valid;
}

